if __name__ =='__main__':
    x = [
  {
    "id": 0,
    "docId": "1345118958",
    "pyear": [
      "2010"
    ],
    "section": [
      "LA"
    ],
    "t": "HTS 로봇 시스템을 활용한 초고속 효소 탐색 기반 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 1,
    "docId": "1345155086",
    "pyear": [
      "2011"
    ],
    "section": [
      "LA"
    ],
    "t": "HTS 로봇 시스템을 활용한 초고속 효소 탐색 기반 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 2,
    "docId": "1345104861",
    "pyear": [
      "2009"
    ],
    "section": [
      "NA"
    ],
    "t": "지능형 초고속 전역최적화 기법인 iDEAS의 개발 및 휴머노이드 로봇 응용",
    "s": 4,
    "b": ""
  },
  {
    "id": 3,
    "docId": "1410032779",
    "pyear": [
      "2005"
    ],
    "section": [
      "UK"
    ],
    "t": "퍼스널로봇 기반기술개발(총괄과제)",
    "s": 3,
    "b": ""
  },
  {
    "id": 4,
    "docId": "1415171811",
    "pyear": [
      "2020"
    ],
    "section": [
      "OC"
    ],
    "t": "수중 선체 청소 로봇의 보급 확대를 위한 수중 로봇 양산 성능 개선 및 실증",
    "s": 4,
    "b": ""
  },
  {
    "id": 5,
    "docId": "1425119624",
    "pyear": [
      "2018"
    ],
    "section": [
      "OB"
    ],
    "t": "지능형 로봇의 인지 고도화를 위한 통합인지시스템",
    "s": 4,
    "b": ""
  },
  {
    "id": 6,
    "docId": "1545013447",
    "pyear": [
      "2016"
    ],
    "section": [
      "LB"
    ],
    "t": "ICT 연동 자율주행 로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 7,
    "docId": "1545016786",
    "pyear": [
      "2018"
    ],
    "section": [
      "LB"
    ],
    "t": "ICT 연동 자율주행 로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 8,
    "docId": "1440001439",
    "pyear": [
      "2006"
    ],
    "section": [
      "EE"
    ],
    "t": "지능형 로봇 센서",
    "s": 4,
    "b": ""
  },
  {
    "id": 9,
    "docId": "1445006185",
    "pyear": [
      "2007"
    ],
    "section": [
      "EE"
    ],
    "t": "지능형 로봇 센서",
    "s": 3,
    "b": ""
  },
  {
    "id": 10,
    "docId": "1711097886",
    "pyear": [
      "2019"
    ],
    "section": [
      "NC"
    ],
    "t": "S3 (Small, Soft, Safe) 3D 로봇 제조 및 구동 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 11,
    "docId": "1711116963",
    "pyear": [
      "2020"
    ],
    "section": [
      "NC"
    ],
    "t": "S3 (Small, Soft, Safe) 3D 로봇 제조 및 구동 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 12,
    "docId": "1415171575",
    "pyear": [
      "2020"
    ],
    "section": [
      "OC"
    ],
    "t": "협업지능기반 로봇플러스 경쟁력 지원사업",
    "s": 4,
    "b": ""
  },
  {
    "id": 13,
    "docId": "1410044616",
    "pyear": [
      "2005"
    ],
    "section": [
      "LB"
    ],
    "t": "스팀 진공청소기 통합 제품,포장",
    "s": 6,
    "b": ""
  },
  {
    "id": 14,
    "docId": "1410048441",
    "pyear": [
      "2005"
    ],
    "section": [
      "LB"
    ],
    "t": "어린이진공청소기제품디자인개발 및 포장디자인개발 통합 제품,포장",
    "s": 10,
    "b": ""
  },
  {
    "id": 15,
    "docId": "1410055057",
    "pyear": [
      "2006"
    ],
    "section": [
      "UK"
    ],
    "t": "헬스케어 로봇 기술개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 16,
    "docId": "1711077778",
    "pyear": [
      "2018"
    ],
    "section": [
      "OC"
    ],
    "t": "한국-유럽 로봇문화 비교연구",
    "s": 3,
    "b": ""
  },
  {
    "id": 17,
    "docId": "1345148708",
    "pyear": [
      "2011"
    ],
    "section": [
      "HC"
    ],
    "t": "로봇의 존재론과 로봇윤리의 기본 원칙",
    "s": 4,
    "b": ""
  },
  {
    "id": 18,
    "docId": "1345168990",
    "pyear": [
      "2012"
    ],
    "section": [
      "HC"
    ],
    "t": "로봇의 존재론과 로봇윤리의 기본 원칙",
    "s": 3,
    "b": ""
  },
  {
    "id": 19,
    "docId": "1415108447",
    "pyear": [
      "2010"
    ],
    "section": [
      "OB"
    ],
    "t": "상황 적응 로봇 인지 기술개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 20,
    "docId": "1415100427",
    "pyear": [
      "2009"
    ],
    "section": [
      "OB"
    ],
    "t": "상황 적응 로봇 인지 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 21,
    "docId": "1395009794",
    "pyear": [
      "2001"
    ],
    "section": [
      "LB"
    ],
    "t": "보식 및 이식로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 22,
    "docId": "1711095557",
    "pyear": [
      "2019"
    ],
    "section": [
      "LA"
    ],
    "t": "뇌어셈블로이드 기반 생명체 모방 센싱 기능 바이오하이브리드 로봇",
    "s": 3,
    "b": ""
  },
  {
    "id": 23,
    "docId": "1711108724",
    "pyear": [
      "2020"
    ],
    "section": [
      "LA"
    ],
    "t": "뇌어셈블로이드 기반 생명체 모방 센싱 기능 바이오하이브리드 로봇",
    "s": 3,
    "b": ""
  },
  {
    "id": 24,
    "docId": "1711099749",
    "pyear": [
      "2019"
    ],
    "section": [
      "OA"
    ],
    "t": "(1차) 몰입형 인간로봇 다중감각 교류기술 상용화",
    "s": 3,
    "b": ""
  },
  {
    "id": 25,
    "docId": "1711116618",
    "pyear": [
      "2020"
    ],
    "section": [
      "OA"
    ],
    "t": "몰입형 인간로봇 다중감각 교류기술 상용화",
    "s": 3,
    "b": ""
  },
  {
    "id": 26,
    "docId": "1415076202",
    "pyear": [
      "2001"
    ],
    "section": [
      "UK"
    ],
    "t": "가정용 청소기",
    "s": 7,
    "b": ""
  },
  {
    "id": 27,
    "docId": "1340027176",
    "pyear": [
      "2004"
    ],
    "section": [
      "LA"
    ],
    "t": "2중 구조의 스튜어트 플랫폼 다리를 갖는 12자유도의 2족 보행 로봇의 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 28,
    "docId": "1545021986",
    "pyear": [
      "2020"
    ],
    "section": [
      "LB"
    ],
    "t": "시설오이 수확 로봇 통합 플랫폼 구축",
    "s": 3,
    "b": ""
  },
  {
    "id": 29,
    "docId": "1415149145",
    "pyear": [
      "2016"
    ],
    "section": [
      "ED"
    ],
    "t": "바닥감지를 통해 걸레판 자동높이조절이 가능한 로봇청소기 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 30,
    "docId": "1415155745",
    "pyear": [
      "2017"
    ],
    "section": [
      "ED"
    ],
    "t": "바닥감지를 통해 걸레판 자동높이조절이 가능한 로봇청소기 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 31,
    "docId": "1345101369",
    "pyear": [
      "2009"
    ],
    "section": [
      "LA"
    ],
    "t": "HTS 로봇 시스템을 활용한 초고속 효소 탐색 기반 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 32,
    "docId": "1410050375",
    "pyear": [
      "2004"
    ],
    "section": [
      "LB"
    ],
    "t": "무인 FA용 자율 주행 지능로봇 시스템",
    "s": 3,
    "b": ""
  },
  {
    "id": 33,
    "docId": "1415077839",
    "pyear": [
      "2007"
    ],
    "section": [
      "UK"
    ],
    "t": "로봇 S/W 프레임워크 기술개발",
    "s": 5,
    "b": ""
  },
  {
    "id": 34,
    "docId": "1410055065",
    "pyear": [
      "2006"
    ],
    "section": [
      "UK"
    ],
    "t": "로봇의 표정구현을 위한 메커니즘 및 립싱크",
    "s": 7,
    "b": ""
  },
  {
    "id": 35,
    "docId": "1415079567",
    "pyear": [
      "2007"
    ],
    "section": [
      "UK"
    ],
    "t": "로봇의 표정구현을 위한 메커니즘 및 립싱크",
    "s": 4,
    "b": ""
  },
  {
    "id": 36,
    "docId": "1415074719",
    "pyear": [
      "2001"
    ],
    "section": [
      "HE"
    ],
    "t": "청소기 브랜드 포장개발",
    "s": 10,
    "b": ""
  },
  {
    "id": 37,
    "docId": "1415069533",
    "pyear": [
      "2000"
    ],
    "section": [
      "SE"
    ],
    "t": "로봇토이",
    "s": 20,
    "b": ""
  },
  {
    "id": 38,
    "docId": "1425118270",
    "pyear": [
      "2018"
    ],
    "section": [
      "EE"
    ],
    "t": "휠리스(Wheelless) 구조 물걸레 로봇청소기의 청소 커버리지 향상을 위한 스마트 비전 매핑 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 39,
    "docId": "1425128932",
    "pyear": [
      "2019"
    ],
    "section": [
      "EE"
    ],
    "t": "휠리스(Wheelless) 구조 물걸레 로봇청소기의 청소 커버리지 향상을 위한 스마트 비전 매핑 기술 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 40,
    "docId": "1415081372",
    "pyear": [
      "2007"
    ],
    "section": [
      "ND"
    ],
    "t": "원자력 발전소에서의 안전검사를 위한 지능기반의 로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 41,
    "docId": "1380002968",
    "pyear": [
      "2006"
    ],
    "section": [
      "LB"
    ],
    "t": "정밀 고속 파종로봇 시스템 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 42,
    "docId": "1465029982",
    "pyear": [
      "2019"
    ],
    "section": [
      "LC"
    ],
    "t": "암세포 특이 나노로봇 정밀 주입용 마이크로 로봇 및 체외용 어시스트 로봇 개발",
    "s": 7,
    "b": ""
  },
  {
    "id": 43,
    "docId": "1465032474",
    "pyear": [
      "2020"
    ],
    "section": [
      "LC"
    ],
    "t": "암세포 특이 나노로봇 정밀 주입용 마이크로 로봇 및 체외용 어시스트 로봇 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 44,
    "docId": "1425087258",
    "pyear": [
      "2014"
    ],
    "section": [
      "LA"
    ],
    "t": "200L 인큐베이터 내 밀폐된 배양공간을 구비한 줄기세포 배양 로봇시스템 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 45,
    "docId": "1410054988",
    "pyear": [
      "2005"
    ],
    "section": [
      "LC"
    ],
    "t": "스팀세차와 진공청소기를 겸한 세차기 제품",
    "s": 4,
    "b": ""
  },
  {
    "id": 46,
    "docId": "1711117354",
    "pyear": [
      "2020"
    ],
    "section": [
      "LA"
    ],
    "t": "로봇 바이오파운드리를 위한 멀티 유전자 어셈블리 클로닝 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 47,
    "docId": "1425045642",
    "pyear": [
      "2007"
    ],
    "section": [
      "LC"
    ],
    "t": "고압분사 오토클린 청소기",
    "s": 6,
    "b": ""
  },
  {
    "id": 48,
    "docId": "1345084455",
    "pyear": [
      "2008"
    ],
    "section": [
      "LA"
    ],
    "t": "바이오 로봇 기법을 적용한 플렉서블 프로테인 도킹 시스템",
    "s": 3,
    "b": ""
  },
  {
    "id": 49,
    "docId": "1345299158",
    "pyear": [
      "2019"
    ],
    "section": [
      "OC"
    ],
    "t": "로봇은 우리를 어떻게 재구성하는가: 정체성, 관계성, 전문성의 관점에서",
    "s": 4,
    "b": ""
  },
  {
    "id": 50,
    "docId": "1415080627",
    "pyear": [
      "2007"
    ],
    "section": [
      "HC"
    ],
    "t": "로봇 환경에서 인지기능 향상을 위한 interactive contents 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 51,
    "docId": "1415080921",
    "pyear": [
      "2007"
    ],
    "section": [
      "LC"
    ],
    "t": "로봇S/W 개발환경",
    "s": 4,
    "b": ""
  },
  {
    "id": 52,
    "docId": "1410040759",
    "pyear": [
      "2004"
    ],
    "section": [
      "EI"
    ],
    "t": "지능형(교육용)로봇 제품",
    "s": 8,
    "b": ""
  },
  {
    "id": 53,
    "docId": "1340014465",
    "pyear": [
      "2005"
    ],
    "section": [
      "LA"
    ],
    "t": "개선된 활성 윤곽선 모델을 이용한 자율적인 로봇 비전 시스템 구현",
    "s": 5,
    "b": ""
  },
  {
    "id": 54,
    "docId": "1425073948",
    "pyear": [
      "2012"
    ],
    "section": [
      "EI"
    ],
    "t": "GPS측량로봇 개발",
    "s": 7,
    "b": ""
  },
  {
    "id": 55,
    "docId": "1420003449",
    "pyear": [
      "2003"
    ],
    "section": [
      "EA"
    ],
    "t": "가정용 무인 로봇 진공청소기 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 56,
    "docId": "1425110341",
    "pyear": [
      "2017"
    ],
    "section": [
      "EF"
    ],
    "t": "친환경 스팀 청소기 개발",
    "s": 6,
    "b": ""
  },
  {
    "id": 57,
    "docId": "1345063213",
    "pyear": [
      "2007"
    ],
    "section": [
      "LA"
    ],
    "t": "고장이 존재하는 다중결합 로봇 시스템의 힘 분배",
    "s": 4,
    "b": ""
  },
  {
    "id": 58,
    "docId": "1345075633",
    "pyear": [
      "2008"
    ],
    "section": [
      "LA"
    ],
    "t": "HTS 로봇 시스템을 활용한 초고속 효소 탐색 기반 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 59,
    "docId": "1415071006",
    "pyear": [
      "2000"
    ],
    "section": [
      "EH"
    ],
    "t": "진공청소기",
    "s": 3,
    "b": ""
  },
  {
    "id": 60,
    "docId": "1440002113",
    "pyear": [
      "2006"
    ],
    "section": [
      "LC"
    ],
    "t": "로봇 입체시각장치 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 61,
    "docId": "1345097014",
    "pyear": [
      "2009"
    ],
    "section": [
      "EE"
    ],
    "t": "가사도우미형 로봇청소기의 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 62,
    "docId": "1380002072",
    "pyear": [
      "2004"
    ],
    "section": [
      "LB"
    ],
    "t": "인공지능 착유 로봇 시스템 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 63,
    "docId": "1380001974",
    "pyear": [
      "2005"
    ],
    "section": [
      "LB"
    ],
    "t": "착유 로봇 시스템 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 64,
    "docId": "1380000155",
    "pyear": [
      "2006"
    ],
    "section": [
      "LB"
    ],
    "t": "착유 로봇 시스템 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 65,
    "docId": "1415074865",
    "pyear": [
      "2001"
    ],
    "section": [
      "EB"
    ],
    "t": "진공청소기 제품",
    "s": 3,
    "b": ""
  },
  {
    "id": 66,
    "docId": "1415079384",
    "pyear": [
      "2007"
    ],
    "section": [
      "EB"
    ],
    "t": "차세대 FPD 진공 로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 67,
    "docId": "1415080696",
    "pyear": [
      "2007"
    ],
    "section": [
      "UK"
    ],
    "t": "차세대 지능형로봇 인력양성사업",
    "s": 4,
    "b": ""
  },
  {
    "id": 68,
    "docId": "1410050085",
    "pyear": [
      "2006"
    ],
    "section": [
      "UK"
    ],
    "t": "차세대 지능형로봇 인력양성사업",
    "s": 8,
    "b": ""
  },
  {
    "id": 69,
    "docId": "1410032803",
    "pyear": [
      "2004"
    ],
    "section": [
      "UK"
    ],
    "t": "포항지능형로봇연구소",
    "s": 3,
    "b": ""
  },
  {
    "id": 70,
    "docId": "1545008661",
    "pyear": [
      "2014"
    ],
    "section": [
      "LB"
    ],
    "t": "Robotic Smart Farming을 위한 로봇 시스템 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 71,
    "docId": "1545008770",
    "pyear": [
      "2014"
    ],
    "section": [
      "LB"
    ],
    "t": "Robotic Smart Farming을 위한 로봇 시스템 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 72,
    "docId": "1420008342",
    "pyear": [
      "2005"
    ],
    "section": [
      "UK"
    ],
    "t": "암거준설용 로봇 개발",
    "s": 7,
    "b": ""
  },
  {
    "id": 73,
    "docId": "1425134017",
    "pyear": [
      "2019"
    ],
    "section": [
      "LA"
    ],
    "t": "미세 유체 기반 생물학 실험실 자동화용 로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 74,
    "docId": "1425114057",
    "pyear": [
      "2017"
    ],
    "section": [
      "EE"
    ],
    "t": "지능형 협업 로봇 제어를 위한 로봇 비전 모듈 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 75,
    "docId": "1711100267",
    "pyear": [
      "2019"
    ],
    "section": [
      "NA"
    ],
    "t": "보행 로봇의 실시간 최적 궤적 생성을 위한 수치 연속 방법",
    "s": 3,
    "b": ""
  },
  {
    "id": 76,
    "docId": "1420000827",
    "pyear": [
      "2002"
    ],
    "section": [
      "UK"
    ],
    "t": "다양한 산업용 로봇의 기구부를 공용으로 사용 가능하게 하는 범용PC로봇 제어기 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 77,
    "docId": "1345267402",
    "pyear": [
      "2017"
    ],
    "section": [
      "OC"
    ],
    "t": "로봇은 우리를 어떻게 재구성하는가: 정체성, 관계성, 전문성의 관점에서",
    "s": 7,
    "b": ""
  },
  {
    "id": 78,
    "docId": "1345279758",
    "pyear": [
      "2018"
    ],
    "section": [
      "OC"
    ],
    "t": "로봇은 우리를 어떻게 재구성하는가: 정체성, 관계성, 전문성의 관점에서",
    "s": 4,
    "b": ""
  },
  {
    "id": 79,
    "docId": "1340025461",
    "pyear": [
      "2003"
    ],
    "section": [
      "LA"
    ],
    "t": "자율적이고 자동화된 병렬기구로봇의 캘리브레이션 시스템 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 80,
    "docId": "1350013129",
    "pyear": [
      "2006"
    ],
    "section": [
      "LA"
    ],
    "t": "유연성을 이용한 속도지향형 4족 로봇 개발",
    "s": 7,
    "b": ""
  },
  {
    "id": 81,
    "docId": "1355050570",
    "pyear": [
      "2007"
    ],
    "section": [
      "LA"
    ],
    "t": "유연성을 이용한 속도지향형 4족 로봇 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 82,
    "docId": "1355043429",
    "pyear": [
      "2001"
    ],
    "section": [
      "EI"
    ],
    "t": "원자력 내방사선 로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 83,
    "docId": "1425135525",
    "pyear": [
      "2019"
    ],
    "section": [
      "ED"
    ],
    "t": "맞춤형 라이다 모듈기반 가정용 로봇청소기 유니버셜 디자인 기술개발",
    "s": 7,
    "b": ""
  },
  {
    "id": 84,
    "docId": "1425139835",
    "pyear": [
      "2020"
    ],
    "section": [
      "ED"
    ],
    "t": "맞춤형 라이다 모듈기반 가정용 로봇청소기 유니버셜 디자인 기술개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 85,
    "docId": "1420002421",
    "pyear": [
      "2005"
    ],
    "section": [
      "NB"
    ],
    "t": "로봇 네비게이션 시스템 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 86,
    "docId": "1345188115",
    "pyear": [
      "2012"
    ],
    "section": [
      "OA"
    ],
    "t": "고령자의 치료 및 재활을 위한 의료용 로봇 시스템 기술 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 87,
    "docId": "1711054671",
    "pyear": [
      "2017"
    ],
    "section": [
      "OA"
    ],
    "t": "로봇보조 보행훈련이 뇌졸중환자의 뇌 재조직화에 미치는 효과",
    "s": 3,
    "b": ""
  },
  {
    "id": 88,
    "docId": "1410056101",
    "pyear": [
      "2005"
    ],
    "section": [
      "UK"
    ],
    "t": "차세대 지능형로봇 인력양성사업",
    "s": 4,
    "b": ""
  },
  {
    "id": 89,
    "docId": "1425105497",
    "pyear": [
      "2016"
    ],
    "section": [
      "EC"
    ],
    "t": "로봇및냉각시스템을 이용한플라스틱사출공정개선사업",
    "s": 4,
    "b": ""
  },
  {
    "id": 90,
    "docId": "1415112564",
    "pyear": [
      "2010"
    ],
    "section": [
      "LC"
    ],
    "t": "자동 분류 및 로봇배출장치를 가진 약품관리시스템과 약품 이송 로봇 시스템",
    "s": 4,
    "b": ""
  },
  {
    "id": 91,
    "docId": "1415119236",
    "pyear": [
      "2011"
    ],
    "section": [
      "LC"
    ],
    "t": "자동 분류 및 로봇배출장치를 가진 약품관리시스템과 약품 이송 로봇 시스템",
    "s": 7,
    "b": ""
  },
  {
    "id": 92,
    "docId": "1420001527",
    "pyear": [
      "2005"
    ],
    "section": [
      "LB"
    ],
    "t": "교육용 로봇 제어를 위한 임베이드 제어킷시스템개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 93,
    "docId": "1420006383",
    "pyear": [
      "2005"
    ],
    "section": [
      "OB"
    ],
    "t": "음성인식 로봇(Robot)을 이용한 대화형 어학 학습기 개발",
    "s": 7,
    "b": ""
  },
  {
    "id": 94,
    "docId": "1711099618",
    "pyear": [
      "2019"
    ],
    "section": [
      "OC"
    ],
    "t": "한국-유럽 로봇문화 비교연구",
    "s": 3,
    "b": ""
  },
  {
    "id": 95,
    "docId": "1425095921",
    "pyear": [
      "2015"
    ],
    "section": [
      "LA"
    ],
    "t": "200L 인큐베이터 내 밀폐된 배양공간을 구비한 줄기세포 배양 로봇시스템 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 96,
    "docId": "1395061127",
    "pyear": [
      "2019"
    ],
    "section": [
      "LB"
    ],
    "t": "로봇 사과과수원 자율주행 프로그램 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 97,
    "docId": "1340013434",
    "pyear": [
      "2005"
    ],
    "section": [
      "NC"
    ],
    "t": "네트워크기반 지능형 로봇시스템 연구",
    "s": 7,
    "b": ""
  },
  {
    "id": 98,
    "docId": "1340017249",
    "pyear": [
      "2003"
    ],
    "section": [
      "NC"
    ],
    "t": "네트워크기반 지능형 로봇시스템 연구",
    "s": 4,
    "b": ""
  },
  {
    "id": 99,
    "docId": "1345105712",
    "pyear": [
      "2009"
    ],
    "section": [
      "EE"
    ],
    "t": "감성교감형 로봇을 위한 인공감정",
    "s": 7,
    "b": ""
  },
  {
    "id": 100,
    "docId": "1345124056",
    "pyear": [
      "2010"
    ],
    "section": [
      "EE"
    ],
    "t": "감성교감형 로봇을 위한 인공감정",
    "s": 4,
    "b": ""
  },
  {
    "id": 101,
    "docId": "1545020077",
    "pyear": [
      "2019"
    ],
    "section": [
      "LB"
    ],
    "t": "로봇형 생육정보 자동측정 시스템 고도화",
    "s": 4,
    "b": ""
  },
  {
    "id": 102,
    "docId": "1345076892",
    "pyear": [
      "2008"
    ],
    "section": [
      "LA"
    ],
    "t": "컴퓨터 시뮬레이션과 로봇을 활용한 게의 생태와 의사소통의 이해",
    "s": 4,
    "b": ""
  },
  {
    "id": 103,
    "docId": "1345320959",
    "pyear": [
      "2020"
    ],
    "section": [
      "NC"
    ],
    "t": "화학적으로 전동된 마이크로 로봇에 대한 이론적 연구",
    "s": 3,
    "b": ""
  },
  {
    "id": 104,
    "docId": "1711008024",
    "pyear": [
      "2013"
    ],
    "section": [
      "EE"
    ],
    "t": "소형 이동 로봇의 자동 설계를 위한 진화 로봇 연구",
    "s": 3,
    "b": ""
  },
  {
    "id": 105,
    "docId": "1415095503",
    "pyear": [
      "2008"
    ],
    "section": [
      "LB"
    ],
    "t": "수륙양용 유량측정로봇 제품디자인 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 106,
    "docId": "1425130606",
    "pyear": [
      "2019"
    ],
    "section": [
      "OB"
    ],
    "t": "지능형 로봇의 인지 고도화를 위한 통합인지시스템",
    "s": 3,
    "b": ""
  },
  {
    "id": 107,
    "docId": "1415076324",
    "pyear": [
      "2001"
    ],
    "section": [
      "UK"
    ],
    "t": "어학 학습 로봇",
    "s": 4,
    "b": ""
  },
  {
    "id": 108,
    "docId": "1410049022",
    "pyear": [
      "2002"
    ],
    "section": [
      "UK"
    ],
    "t": "퍼스널로봇 기반기술개발(총괄과제)",
    "s": 7,
    "b": ""
  },
  {
    "id": 109,
    "docId": "1410049408",
    "pyear": [
      "2003"
    ],
    "section": [
      "UK"
    ],
    "t": "퍼스널로봇 기반기술개발(총괄과제)",
    "s": 4,
    "b": ""
  },
  {
    "id": 110,
    "docId": "1340014790",
    "pyear": [
      "2005"
    ],
    "section": [
      "LA"
    ],
    "t": "동역학적 영향을 고려한 다족 보행 로봇의 내고장성 걸음새",
    "s": 3,
    "b": ""
  },
  {
    "id": 111,
    "docId": "1345084685",
    "pyear": [
      "2008"
    ],
    "section": [
      "NB"
    ],
    "t": "감성 지능형 로봇제어 시스템개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 112,
    "docId": "1340026187",
    "pyear": [
      "2003"
    ],
    "section": [
      "LA"
    ],
    "t": "관절고착고장에대한육각보행로봇의내고장성걸음새생성",
    "s": 3,
    "b": ""
  },
  {
    "id": 113,
    "docId": "1425140496",
    "pyear": [
      "2020"
    ],
    "section": [
      "OB"
    ],
    "t": "지능형 로봇의 인지 고도화를 위한 통합인지시스템",
    "s": 3,
    "b": ""
  },
  {
    "id": 114,
    "docId": "1410038780",
    "pyear": [
      "2003"
    ],
    "section": [
      "LB"
    ],
    "t": "스틱형 스팀청소기 제품디자인 제품",
    "s": 4,
    "b": ""
  },
  {
    "id": 115,
    "docId": "1415110862",
    "pyear": [
      "2010"
    ],
    "section": [
      "LC"
    ],
    "t": "생체모방형 로봇시스템개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 116,
    "docId": "1395028271",
    "pyear": [
      "2012"
    ],
    "section": [
      "LB"
    ],
    "t": "엽채소 수확 및 포장 로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 117,
    "docId": "1415118406",
    "pyear": [
      "2011"
    ],
    "section": [
      "LC"
    ],
    "t": "생체모방형 로봇시스템개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 118,
    "docId": "1355050729",
    "pyear": [
      "2007"
    ],
    "section": [
      "EB"
    ],
    "t": "C 로봇의 기술개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 119,
    "docId": "1410048176",
    "pyear": [
      "2006"
    ],
    "section": [
      "LA"
    ],
    "t": "극저온 보관 시스템의 로봇 arm 및 제어 시스템 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 120,
    "docId": "1340011074",
    "pyear": [
      "2006"
    ],
    "section": [
      "UK"
    ],
    "t": "지식기반기계산업(메카트로닉스.로봇)산학연공동사업단",
    "s": 7,
    "b": ""
  },
  {
    "id": 121,
    "docId": "1345056607",
    "pyear": [
      "2007"
    ],
    "section": [
      "UK"
    ],
    "t": "지식기반기계산업(메카트로닉스.로봇)산학연공동사업단",
    "s": 4,
    "b": ""
  },
  {
    "id": 122,
    "docId": "1420002378",
    "pyear": [
      "2004"
    ],
    "section": [
      "UK"
    ],
    "t": "인간형 2족 보행로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 123,
    "docId": "1410039402",
    "pyear": [
      "2006"
    ],
    "section": [
      "UK"
    ],
    "t": "로봇최적설계지원시스템 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 124,
    "docId": "1711069426",
    "pyear": [
      "2018"
    ],
    "section": [
      "OA"
    ],
    "t": "로봇보조 보행훈련이 뇌졸중환자의 뇌 재조직화에 미치는 효과",
    "s": 3,
    "b": ""
  },
  {
    "id": 125,
    "docId": "1410053951",
    "pyear": [
      "2006"
    ],
    "section": [
      "LB"
    ],
    "t": "다족형 견마로봇 플랫폼 기술개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 126,
    "docId": "1345059847",
    "pyear": [
      "2007"
    ],
    "section": [
      "LA"
    ],
    "t": "인간형 로봇의 에너지 효율 향상을 위한 준-수동 보행 로봇 연구",
    "s": 3,
    "b": ""
  },
  {
    "id": 127,
    "docId": "1390000761",
    "pyear": [
      "2002"
    ],
    "section": [
      "UK"
    ],
    "t": "보식 및 이식로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 128,
    "docId": "1415069038",
    "pyear": [
      "1999"
    ],
    "section": [
      "UK"
    ],
    "t": "병원내 서비스로봇의 개발",
    "s": 7,
    "b": ""
  },
  {
    "id": 129,
    "docId": "1415070233",
    "pyear": [
      "2000"
    ],
    "section": [
      "UK"
    ],
    "t": "병원내 서비스로봇의 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 130,
    "docId": "1395061150",
    "pyear": [
      "2019"
    ],
    "section": [
      "LB"
    ],
    "t": "과원용 로봇 방제 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 131,
    "docId": "1395066025",
    "pyear": [
      "2020"
    ],
    "section": [
      "LB"
    ],
    "t": "과원용 로봇 방제 기술 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 132,
    "docId": "1415110325",
    "pyear": [
      "2010"
    ],
    "section": [
      "ED"
    ],
    "t": "회전식 물걸레 로봇 청소기 제작",
    "s": 3,
    "b": ""
  },
  {
    "id": 133,
    "docId": "1425123460",
    "pyear": [
      "2018"
    ],
    "section": [
      "EE"
    ],
    "t": "지능형 협업 로봇 제어를 위한 로봇 비전 모듈 개발",
    "s": 7,
    "b": ""
  },
  {
    "id": 134,
    "docId": "1425129707",
    "pyear": [
      "2019"
    ],
    "section": [
      "EE"
    ],
    "t": "지능형 협업 로봇 제어를 위한 로봇 비전 모듈 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 135,
    "docId": "1340019494",
    "pyear": [
      "2004"
    ],
    "section": [
      "UK"
    ],
    "t": "지식기반기계산업메카트로닉스·로봇인력양성사업",
    "s": 4,
    "b": ""
  },
  {
    "id": 136,
    "docId": "1410033895",
    "pyear": [
      "2002"
    ],
    "section": [
      "UK"
    ],
    "t": "마이크로로봇 전문인력양성",
    "s": 7,
    "b": ""
  },
  {
    "id": 137,
    "docId": "1415073611",
    "pyear": [
      "2001"
    ],
    "section": [
      "UK"
    ],
    "t": "마이크로로봇 전문인력양성",
    "s": 4,
    "b": ""
  },
  {
    "id": 138,
    "docId": "1425096290",
    "pyear": [
      "2015"
    ],
    "section": [
      "SH"
    ],
    "t": "블록형 로봇팔",
    "s": 4,
    "b": ""
  },
  {
    "id": 139,
    "docId": "1410041043",
    "pyear": [
      "2002"
    ],
    "section": [
      "UK"
    ],
    "t": "홈네트웍 로봇 제품",
    "s": 6,
    "b": ""
  },
  {
    "id": 140,
    "docId": "1420014107",
    "pyear": [
      "2005"
    ],
    "section": [
      "UK"
    ],
    "t": "자율비행 Quadcopter 로봇 시스템 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 141,
    "docId": "1415171335",
    "pyear": [
      "2020"
    ],
    "section": [
      "OC"
    ],
    "t": "5G기반 첨단제조로봇 실증기반 구축사업",
    "s": 3,
    "b": ""
  },
  {
    "id": 142,
    "docId": "1340014565",
    "pyear": [
      "2005"
    ],
    "section": [
      "LA"
    ],
    "t": "복잡한 지형에 유연하게 적응할 수 있는 다족 모바일 로봇의 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 143,
    "docId": "1415147189",
    "pyear": [
      "2016"
    ],
    "section": [
      "EH"
    ],
    "t": "로봇 청소기용 친환경 고효율 UV LED 살균모듈 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 144,
    "docId": "1395066039",
    "pyear": [
      "2020"
    ],
    "section": [
      "LB"
    ],
    "t": "로봇 사과과수원 자율주행 프로그램 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 145,
    "docId": "1545022002",
    "pyear": [
      "2020"
    ],
    "section": [
      "LB"
    ],
    "t": "과수 재배관리용(전정, 적과 등) 로봇 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 146,
    "docId": "1410033156",
    "pyear": [
      "2003"
    ],
    "section": [
      "ED"
    ],
    "t": "로봇청소기 제품디자인개발 제품",
    "s": 4,
    "b": ""
  },
  {
    "id": 147,
    "docId": "1345142426",
    "pyear": [
      "2010"
    ],
    "section": [
      "EE"
    ],
    "t": "가사도우미형 로봇청소기의 개발",
    "s": 3,
    "b": ""
  },
  {
    "id": 148,
    "docId": "1395048469",
    "pyear": [
      "2016"
    ],
    "section": [
      "LB"
    ],
    "t": "딸기 수확용 로봇의 성능 개선 연구",
    "s": 3,
    "b": ""
  },
  {
    "id": 149,
    "docId": "1420022775",
    "pyear": [
      "2006"
    ],
    "section": [
      "HE"
    ],
    "t": "스팀청소기와 진공청소기가 결합된 가정용 복합청소기 개발",
    "s": 4,
    "b": ""
  },
  {
    "id": 150,
    "docId": "1711092612",
    "pyear": [
      "2019"
    ],
    "section": [
      "OA"
    ],
    "t": "로봇보조 보행훈련이 뇌졸중환자의 뇌 재조직화에 미치는 효과",
    "s": 3,
    "b": ""
  },
  {
    "id": 151,
    "docId": "1415077263",
    "pyear": [
      "2007"
    ],
    "section": [
      "LB"
    ],
    "t": "다족형 견마로봇 플랫폼 기술 개발",
    "s": 3,
    "b": ""
  }
]
    print(len(x))